Mock.mock('http://mockjs', {
	"list|10": [{
		"did|+1": 1,
		"name": "@constellation",
		"price|12-26": 12,
		"material": "@cparagraph()",
		"img_sm": "@imgUrl()",
		"detail":"@cparagraph()",
		"img_lg":"@imgUrlBig()"
	}]
});

Mock.mock('http://fix', {"list":[{"did":1,"name":"糖熘儿","price":13,"material":"二只已史命压社号备制文京极。八率电已出书感广许真几太。织么众如自基强酸众特组按厂标越。国员期外光人第己消都最军六路了同。相取进和整单导后山政南然收于成毛题定。只金变养之对就水放行族它局族利在。","img_sm":"p8489.jpg","detail":"场两所内引带门红严它压容内。那示养验水备就手求少些农。信最火按即界回成须几步习中属易号流明。入性件儿层么山装管型生知。包美支战工响立角体众头外证院资手也时。","img_lg":"p7818-l.jpg"},{"did":2,"name":"炸面筋","price":20,"material":"里技近再听提研百林较文其新生革。化生以等识根切好次己就团小队等。高严华过农书际始拉空产方基口结音。","img_sm":"p9138.jpg","detail":"记通因角会层划争边物心律力形类。立节指类二公容林张又始部大专解好北程。导光老毛别两联值须身或数。","img_lg":"p4788-l.jpg"},{"did":3,"name":"梅菜茄子","price":19,"material":"文离力包程实断往车养身之能根青中素。厂并保界之识斯难复层起金程头看历属。少织术阶总况很府变百老外西于表白。声须半持何格过变广证书设几权级。","img_sm":"p4788.jpg","detail":"向院定素性林明号候为面如机太组就。龙生知厂七作别准极争系最济育划。党青体了政运数期特门精是建新接积才。制红号者导管素则生政研公也些。","img_lg":"p8489-l.jpg"},{"did":4,"name":"龙须菜","price":20,"material":"王确共快能力都土山与无上严置。积决个成石般表太四放际级接等。领业条当政育主明十心之连式型声。系器参信交风间华着次养领类除七装那。","img_sm":"p7818.jpg","detail":"原成话京广军米指革斯收它化示增计消。全时示角适极量快去调深低。分时第却接史时们千明金规下么化别。化毛参许报问才东能委细铁。转持权深往习场日劳省那儿。","img_lg":"p7933-l.jpg"},{"did":5,"name":"拔丝山药","price":26,"material":"周主你切由支主产果军青日道转。统研事克八道所造图路劳区于。第约列争方约步开社研体济劳。亲受研向济局义它它员史离期。","img_sm":"p0281.jpg","detail":"器表些参拉基美走时白写小即。西别议真权构习国但交以运。和统何完与热今引又则为现。于也米志学真连期易技的作适。素边边起年变和当他系有进此。","img_lg":"p6611-l.jpg"},{"did":6,"name":"炝冬笋","price":18,"material":"四相较易约土然各自快史却着王其节改。总调说圆张验术史速得万其还起期。厂市日决着切院布斯革后组。己它难做世效劳价按厂空连流儿复。","img_sm":"p6611.jpg","detail":"单手据海解选温那般气用京小局。质于二调技列写商值石众组合马界历会。原例是至集战设候广机别达比从间响级。指就状图带学业做安积下今。合研亲越他片复步取它联书验别属大。精那五族己地拉科办即知只又具又战心。音条状团院建门确论出们称率律积族入。","img_lg":"p4788-l.jpg"},{"did":7,"name":"炸面筋","price":21,"material":"处院还资资等地圆族织连农色单。又压利众口科到日就往只土精节。京马统该高近眼产们西细集素运问条便。群准物易金前光育数用育指列政克百。安书西东且万置特最酸资证单清着见。些即制实战光一多如引更才。持每长周东断生压争格党六种正同活易。","img_sm":"p7933.jpg","detail":"则型面圆候千六己作层国一九提运主这自。阶文已金海着美这连战员立动。则才是型组难气关正石当动装因结有马。派群话行收权更选他以根市。","img_lg":"p9138-l.jpg"},{"did":8,"name":"拔丝山药","price":23,"material":"思须型设转引象通导于在感包。行三文近特需实级京目合事规。技格县发原类数易七以济连想。细报织很县第车斯开引光两南如。叫众白角位理选百第划也区性者。","img_sm":"p9138.jpg","detail":"如即年水火育导精必身农政党众。之验题到习成八龙行造存斯规指。从是许器部装少儿八持入同者从。","img_lg":"p7818-l.jpg"},{"did":9,"name":"拌海蜇","price":20,"material":"行立还动的红研候个还识温想做查管。般山利始者年酸体写调新和学务往。须路治群根二维广能期资治论许次间是。","img_sm":"p7933.jpg","detail":"边准其百拉被商思制大格土无受此你。政加场受北明管几区道教东全人积研接。日计划引面题龙历由约府这同全往。商决以全步器明非数之存结族成并音事。","img_lg":"p2679-l.jpg"},{"did":10,"name":"龙须菜","price":21,"material":"理作带门果解候往养史天种。叫正报与养过算号便例领面员。并几上内况别热满江于五林约革月张。一分识青治音经须强可这总任着院。","img_sm":"p4788.jpg","detail":"研族斯队往还那向任义济集看。已子务全当还质该天题断点关斯先决直条。率习离起交般已资空基则区例然速般运。成七即分断养根明交电天须每又斗通。当期记处低始质人联不次清算交机。中复就除口机打层度入分做色先书金报。","img_lg":"p7818-l.jpg"}]});

var Random = Mock.Random;
Random.extend({
	constellation: function(date) {
		var constellations = ['梅菜茄子', '山鸡丁儿', '拌海蜇', '龙须菜', '炝冬笋', '玉兰片', '烧鱼头', '烧百合', '炸豆腐', '炸面筋', '糖熘儿', '拔丝山药']
		return this.pick(constellations)
	},
	imgUrl: function(data) {
		var img = ['p9138.jpg', 'p8489.jpg', 'p7933.jpg', 'p7818.jpg', 'p6611.jpg', 'p4788.jpg', 'p2679.jpg', 'p0281.jpg']
		return this.pick(img)
	},
	imgUrlBig:function(data){
		var img = ['p9138-l.jpg', 'p8489-l.jpg', 'p7933-l.jpg', 'p7818-l.jpg', 'p6611-l.jpg', 'p4788-l.jpg', 'p2679-l.jpg', 'p0281-l.jpg']
		return this.pick(img)
	}
})
Random.constellation()
Random.imgUrl()
Random.imgUrlBig()
Mock.mock('@constellation')
Mock.mock('@imgUrl')
Mock.mock('@imgUrlBig')